libxmlbus/data/wsaddr-testset/documents/notify/soap12/message3.xml

<?xml version='1.0' ?>
<!-- $Id: message3.xml,v 1.2 2006/02/20 16:01:17 pdowney Exp $ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
 xmlns:wsa="http://www.w3.org/2005/08/addressing">
 <env:Header>
  <wsa:To>http://example.org/node/A</wsa:To>
  <wsa:Action>http://example.org/action/notify</wsa:Action>
  <wsa:FaultTo>
   <wsa:Address>http://www.w3.org/2005/08/addressing/none</wsa:Address>
  </wsa:FaultTo>
 </env:Header>
 <env:Body>
  <m:notify xmlns:m="http://example.org/notify">Message 3</m:notify>
 </env:Body>
</env:Envelope>
